; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport city-sequential-3nodes-1000size-4degree-100mindistance-6trucks-4packages-890seed

(define (problem transport-city-sequential-3nodes-1000size-4degree-100mindistance-6trucks-4packages-890seed)
 (:domain transport)
 (:objects
  city-loc-1 - location
  city-loc-2 - location
  city-loc-3 - location
  truck-1 - vehicle
  truck-2 - vehicle
  truck-3 - vehicle
  truck-4 - vehicle
  truck-5 - vehicle
  truck-6 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 316,290 -> 49,874
  (road city-loc-2 city-loc-1)
  (= (road-length city-loc-2 city-loc-1) 65)
  ; 49,874 -> 316,290
  (road city-loc-1 city-loc-2)
  (= (road-length city-loc-1 city-loc-2) 65)
  ; 922,272 -> 316,290
  (road city-loc-3 city-loc-2)
  (= (road-length city-loc-3 city-loc-2) 61)
  ; 316,290 -> 922,272
  (road city-loc-2 city-loc-3)
  (= (road-length city-loc-2 city-loc-3) 61)
  (at package-1 city-loc-3)
  (at package-2 city-loc-3)
  (at package-3 city-loc-1)
  (at package-4 city-loc-2)
  (at truck-1 city-loc-2)
  (capacity truck-1 capacity-2)
  (at truck-2 city-loc-3)
  (capacity truck-2 capacity-3)
  (at truck-3 city-loc-1)
  (capacity truck-3 capacity-3)
  (at truck-4 city-loc-1)
  (capacity truck-4 capacity-4)
  (at truck-5 city-loc-3)
  (capacity truck-5 capacity-4)
  (at truck-6 city-loc-3)
  (capacity truck-6 capacity-3)
 )
 (:goal (and
  (at package-1 city-loc-2)
  (at package-2 city-loc-1)
  (at package-3 city-loc-2)
  (at package-4 city-loc-3)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (pick-up truck-1 city-loc-2 package-4 capacity-1 capacity-2)
   deleted: (at package-4 city-loc-2) (capacity truck-1 capacity-2)
   added: (in package-4 truck-1) (capacity truck-1 capacity-1)
   goals met: 0 of 4
2. (drive truck-1 city-loc-2 city-loc-3)
   deleted: (at truck-1 city-loc-2)
   added: (at truck-1 city-loc-3)
   goals met: 0 of 4
3. (pick-up truck-1 city-loc-3 package-2 capacity-0 capacity-1)
   deleted: (at package-2 city-loc-3) (capacity truck-1 capacity-1)
   added: (in package-2 truck-1) (capacity truck-1 capacity-0)
   goals met: 0 of 4
4. (drop truck-1 city-loc-3 package-4 capacity-0 capacity-1)
   deleted: (in package-4 truck-1) (capacity truck-1 capacity-0)
   added: (at package-4 city-loc-3) (capacity truck-1 capacity-1)
   goals met: 1 of 4
5. (pick-up truck-1 city-loc-3 package-1 capacity-0 capacity-1)
   deleted: (at package-1 city-loc-3) (capacity truck-1 capacity-1)
   added: (in package-1 truck-1) (capacity truck-1 capacity-0)
   goals met: 1 of 4
6. (drive truck-1 city-loc-3 city-loc-2)
   deleted: (at truck-1 city-loc-3)
   added: (at truck-1 city-loc-2)
   goals met: 1 of 4
7. (drop truck-1 city-loc-2 package-1 capacity-0 capacity-1)
   deleted: (in package-1 truck-1) (capacity truck-1 capacity-0)
   added: (at package-1 city-loc-2) (capacity truck-1 capacity-1)
   goals met: 2 of 4
8. (drive truck-1 city-loc-2 city-loc-1)
   deleted: (at truck-1 city-loc-2)
   added: (at truck-1 city-loc-1)
   goals met: 2 of 4
9. (drop truck-1 city-loc-1 package-2 capacity-1 capacity-2)
   deleted: (in package-2 truck-1) (capacity truck-1 capacity-1)
   added: (at package-2 city-loc-1) (capacity truck-1 capacity-2)
   goals met: 3 of 4
10. (pick-up truck-1 city-loc-1 package-3 capacity-1 capacity-2)
   deleted: (at package-3 city-loc-1) (capacity truck-1 capacity-2)
   added: (in package-3 truck-1) (capacity truck-1 capacity-1)
   goals met: 3 of 4
11. (drive truck-1 city-loc-1 city-loc-2)
   deleted: (at truck-1 city-loc-1)
   added: (at truck-1 city-loc-2)
   goals met: 3 of 4
12. (drop truck-1 city-loc-2 package-3 capacity-1 capacity-2)
   deleted: (in package-3 truck-1) (capacity truck-1 capacity-1)
   added: (at package-3 city-loc-2) (capacity truck-1 capacity-2)
   goals met: 4 of 4
